<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<title>Insert title here</title>
</head>
<body>
<!-- -----------------------------------------------------------------------------------------------------------  -->
	<h3>10.구구단 출력하기2</h3>
	<small>
		1. 각각의 버튼을 클릭시 내용에 맞는 구구단 출력	<br/>	
		2. 출력된 구구단의 내용은 제거 버튼 클릭시 이전 상태로 초기화 (꼭 자신의 단*1=계산값으로 초기화) <br/>
		3. html/css 화면과 동일해야 함 (작성 코드는 달라도 정말 비슷하게 보여야 함)<br/>
		4. 브라우저 창을 줄여도 움직이지 않는다 (스크롤 바가 나온다)<br/>
		5. 같은 단을 여러번 클릭해도 더 추가해서 나오지 않는다.<br/>
		6. 절대 fieldset 경계선 범위를 넘지 않는다 (그림상의 두꺼운 선)<br/>
	</small>
	<fieldset>
<!-- 		화면과 설명을 보고 그대로 구현하시오		 -->
		<!-- 여기에 작성 -->
		
		
		
		
		
		
	</fieldset>
</body>
</html>