package five78.test;

import java.util.ArrayList;
import java.util.List;

public class BasicArrayListTest4 {

	public static void main(String[] args) {

//		3개의 쇼핑 항목을 확인하는 프로그램
		
//		의류, 잡화, 식품, 가전, 스포츠, 공구, 도서, 생필품이 있다
//		
//		사용자가 의류를 입력하면
//		의류를 리스트에 추가한다
//		
//		식품을 입력하면 
//		식품을 리스트에 추가한다
//		
//		도서를 입력하면 
//		도서를 리스트에 추가한다
//		
//		3개를 다 담은 경우 
//		
//		사용자가 담은 항목을 출력한 후
//		
//		프로그램을 종료한다
//		
//		만약1.
//		쇼핑 항목에 없는 단어를 입력하면
//		잘못 입력했다는 메시지를 출력하고 
//		위의 내용을 반복한다
//		
//		만약2.
//		의류가 리스트에 담긴 상태에서 
//		사용자가 다시 의류를 입력하면
//		'이미 리스트에 있습니다'
//		'다른 항목을 입력해주세요' 라고 출력하며
//		다시 위의 내용을 반복한다
				
		
	}

}
